
#### Environment path ./IaC/environments/production
#### Terraform Plan 📖success`
<details><summary>Show Plan Details</summary>

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_eventhub_namespace.example will be created
  + resource "azurerm_eventhub_namespace" "example" {
      + auto_inflate_enabled                      = false
      + capacity                                  = 1
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "westeurope"
      + maximum_throughput_units                  = (known after apply)
      + minimum_tls_version                       = (known after apply)
      + name                                      = "example-eh"
      + network_rulesets                          = (known after apply)
      + public_network_access_enabled             = true
      + resource_group_name                       = "rg-network-production"
      + sku                                       = "Premium"
      + zone_redundant                            = false
    }

  # module.demo_resource_group.azurerm_resource_group.rg["0"] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-network-production"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Reference to undefined provider

  on main.tf line 8, in module "demo_resource_group":
   8:   providers   = { azurerm = azurerm.sub-dev }

There is no explicit declaration for local provider name "azurerm" in
module.demo_resource_group, so Terraform is assuming you mean to pass a
configuration for "hashicorp/azurerm".

If you also control the child module, add a required_providers entry named
"azurerm" with the source address "hashicorp/azurerm".

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

</details>

*Pusher: @adammontlake, Action: `pull_request`, Working Directory: ``, Workflow: `action-on-pull`*